app/controllers/buildings_controller.rb

SELECT * FROM `buildings`
SELECT * FROM `features`
---
  def index
    @buildings = Building.all
    @features = Feature.all

SELECT * FROM `buildings` WHERE (`buildings`.`id` = 1)
SELECT * FROM `features`
---
  def show
    @building = Building.find(params[:id])
    @features = Feature.all

SELECT * FROM `features`
---
  def new
    @building = Building.new
    @features = Feature.all

SELECT * FROM `buildings` WHERE (`buildings`.`id` = 2)
---
  def edit
    @features = Feature.find(:all)
    @building = Building.find(params[:id])

INSERT INTO `buildings` (`name`, `address`, `floors`, `created_at`, `code`, `zip_code`, `updated_at`, `marker`, `lng`, `building_type`, `lat`) VALUES('Bahen Center', '40 St. George Street, Toronto, ON', 7, '2009-07-15 23:10:57', 'BA', '', '2009-07-15 23:10:57', NULL, -79.3967687, 'Engineering building', 43.660015)
SELECT * FROM `features`
SELECT * FROM `features` WHERE (`features`.`id` = 1)
---
  def create

    @building = Building.new(params[:building])
    @building.address = @building.address << ', Toronto, ON'
    @features = Feature.all
    checked_features = []



    checked_params = params[:feature_list] || []
    for check_box_id in checked_params
    	feature = Feature.find (check_box_id)

SELECT * FROM `buildings` WHERE (`buildings`.`id` = 2)
SELECT * FROM `features`
SELECT * FROM `features` WHERE (`features`.`id` = 1)
SELECT `features`.id FROM `features` INNER JOIN `buildings_features` ON `features`.id = `buildings_features`.feature_id WHERE (`features`.`id` = 1) AND (`buildings_features`.building_id = 1 ) LIMIT 1
UPDATE `buildings` SET `updated_at` = '2009-07-13 19:17:39', `address` = '25 St. George Street, Toronto, ON', `lat` = NULL, `lng` = NULL WHERE `id` = 1
---
  def update
    @building = Building.find(params[:id])
    @features = Feature.all
    checked_features = []



    checked_params = params[:feature_list] || []
    for check_box_id in checked_params
    	feature = Feature.find (check_box_id)
    	if not @building.features.include?(feature)
    		@building.features << feature
    	end
    	checked_features << feature

    end
		missing_features = @features - checked_features
		for feature in missing_features
			if @building.features.include?(feature)
				@building.features.delete(feature)
			end
	  end

    respond_to do |format|
      if @building.update_attributes(params[:building])

SELECT * FROM `buildings` WHERE (`buildings`.`id` = 1)
DELETE FROM `buildings` WHERE `id` = 1
---
  def destroy
    @building = Building.find(params[:id])
    @building.destroy