app/controllers/chapter_controller.rb

SELECT * FROM `buildings`
---
def list
render :text=>(Building.find :all).to_json