app/controllers/chapter_controller.rb

def list
@feature = Feature.find(params[:feature])
---
SELECT * FROM `features` WHERE (`features`.`id` = 3)