app/controllers/features_controller.rb

SELECT * FROM `features`
---
  def index
    @features = Feature.all

SELECT * FROM `features` WHERE (`features`.`id` = 1)
---
  def show
    @feature = Feature.find(params[:id])

SELECT * FROM `features` WHERE (`features`.`id` = 1)
---
  def edit
    @feature = Feature.find(params[:id])

INSERT INTO `features` (`name`, `created_at`, `updated_at`) VALUES('Engineering Building', '2009-08-09 21:11:40', '2009-08-09 21:11:40')
---
  def create
    @feature = Feature.new(params[:feature])

    respond_to do |format|
      if @feature.save

SELECT * FROM `features` WHERE (`features`.`id` = 1)
---
  def update
    @feature = Feature.find(params[:id])