app/controllers/maps_controller.rb

def simple_map
	# Create a new map object, also defining the div ("map")
	# where the map will be rendered in the view
	@map = GMap.new("map")
	# Use the larger pan/zoom control but disable the map type
	# selector
	@map.control_init(:large_map => true,:map_type => false)
	# Center the map on specific coordinates and focus in fairly
	# closely
	@map.center_zoom_init([43.662521,-79.395837], 16)

	@buildings = Building.find (:all)
---
SELECT * FROM `buildings`

def display_markers
		@building = Building.find(params[:id])
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 2)

def remove_markers
		@building = Building.find(params[:id])
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 2)