app/controllers/obbjects_controller.rb

  def index
    @obbjects = Obbject.all
---
SELECT * FROM `obbjects`

  def show
    @obbject = Obbject.find(params[:id])
---
SELECT * FROM `obbjects` WHERE (`obbjects`.`id` = 1)

  def new
    @obbject = Obbject.new
    @buildings = Building.all
---
SELECT * FROM `buildings`

  def edit
    @obbject = Obbject.find(params[:id])
---
SELECT * FROM `obbjects` WHERE (`obbjects`.`id` = 1)

  def create
    @obbject = Obbject.new(params[:obbject])
 		building = Building.find(params[:building_id])
 		@obbject.building = building
    respond_to do |format|
      if @obbject.save
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 1)
INSERT INTO `obbjects` (`name`, `created_at`, `updated_at`, `floor`, `description`, `building_id`) VALUES('', '2009-09-01 01:13:07', '2009-09-01 01:13:07', NULL, '', NULL)

  def update
    @obbject = Obbject.find(params[:id])
		building = Building.find(params[:building_id])
 		@obbject.building = building
    respond_to do |format|
      if @obbject.update_attributes(params[:obbject])
---
SELECT * FROM `obbjects` WHERE (`obbjects`.`id` = 3)
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 2)
UPDATE `obbjects` SET `updated_at` = '2009-09-01 01:26:23', `building_id` = 2 WHERE `id` = 3

  def destroy
    @obbject = Obbject.find(params[:id])
    @obbject.destroy
---
SELECT * FROM `obbjects` WHERE (`obbjects`.`id` = 1)
DELETE FROM `obbjects` WHERE `id` = 1